Repository: Beatific-Angel/Next-js-Tailwind-Integration
Catalog: translations/*.po
Languages: nl

source: High Five Client registration module
nl: HighFive Client registratie module

source: Creates a form that can be used to register clients
nl: Maakt een formulier dat gebruik kan worden voor het registreren van clients

source: Create your Fitness Network account here. You'll need this account to view all subscriptions and prices and to subscribe. With this account, you can also view your subscriptions, invoices and edit your profile data.
nl: Maak hier je Fitness Network account aan. Je hebt dit account nodig om alle abonnementen en de bijbehorende prijzen te kunnen bekijken en een abonnement af te sluiten. Met dit account kan je straks ook je abonnement beheren, je facturen terugvinden en je gegevens wijzigen.

source: First name
nl: Voornaam

source: Enter your first name
nl: Typ je voornaam

source: Last name
nl: Achternaam

source: Enter your last name
nl: Typ je achternaam

source: Organisation
nl: Organisatie

source: Select your organisation
nl: Kies je organisatie

source: Organisation ID
nl: Organisatie ID

source: Type the ID of your organisation
nl: Typ het ID van je organisatie

source: Your employee number
nl: Je personeelsnummer

source: Employee number
nl: Personeelsnummer

source: Type your employee number
nl: Typ je personeelsnummer

source: Department
nl: Afdeling

source: Select your department
nl: Kies je afdeling

source: Email address
nl: E-mailadres

source: Type your email address
nl: Typ je e-mailadres

source: Password
nl: Wachtwoord

source: Type your password again
nl: Typ je wachtwoord opnieuw

source: Create account
nl: Creëer je account

source: Client Registration Form
nl: Client registratie formulier
